{
  "doc_id": "https://www.nasa.gov/missions/chandra/supernova-remnant-video-from-nasas-chandra-is-decades-in-making/",
  "source": "NASA",
  "url": "https://www.nasa.gov/missions/chandra/supernova-remnant-video-from-nasas-chandra-is-decades-in-making/",
  "title": "Supernova Remnant Video From NASA’s Chandra Is Decades in Making",
  "published_at": "Tue, 06 Jan 2026 21:30:45 +0000",
  "language": null,
  "section": null,
  "content_raw_text": "A new video shows the evolution of Kepler’s Supernova Remnant using data from NASA’s Chandra X-ray Observatory captured over more than two and a half decades.\nKepler’s Supernova Remnant, named after the German astronomer Johannes Kepler, was first spotted in the night sky in 1604. Today, astronomers know that a white dwarf star exploded when it exceeded a critical mass, after pulling material from a companion star, or merging with another white dwarf. This kind of supernova is known as a Type Ia, and scientists use it to measure the expansion of the universe.\nSupernova remnants, the debris fields left behind after a stellar explosion, often glow strongly in X-ray light because the material has been heated to millions of degrees from the blast. The remnant is located in our galaxy, about 17,000 light-years from Earth, allowing Chandra to make detailed images of the debris and how it changes with time. This latest video includes its X-ray data from 2000, 2004, 2006, 2014, and 2025. This makes it the longest-spanning video that Chandra has ever released, enabled by Chandra’s longevity.\n“The plot of Kepler’s story is just now beginning to unfold,” said Jessye Gassel, a graduate student at George Mason University in Virginia, who led the work. “It’s remarkable that we can watch as these remains from this shattered star crash into material already thrown out into space.” Gassel presented the new Chandra video and the associated research at the 247th meeting of the American Astronomical Society in Phoenix.\nThe researchers used the video to show that the fastest parts of the remnant are traveling at about 13.8 million miles per hour (2% of the speed of light), moving toward the bottom of the image. Meanwhile, the slowest parts are traveling toward the top at about 4 million miles per hour (0.5% of the speed of light). This large difference in speed is because the gas that the remnant is plowing into toward the top of the image is denser than the gas toward the bottom. This gives scientists information about the environments into which this star exploded.\n“Supernova explosions and the elements they hurl into space are the lifeblood of new stars and planets,” said Brian Williams of NASA’s Goddard Space Flight Center in Greenbelt, Maryland, and principal investigator of the new Chandra observations of Kepler. “Understanding exactly how they behave is crucial to knowing our cosmic history.”\nThe team also examined the widths of the rims forming the blast wave of the explosion. The blast wave is the leading edge of the explosion and the first to encounter material outside of the star. By measuring how wide it is and how fast it is traveling, astronomers glean more information about both the explosion of the star and its surroundings.\nNASA’s Marshall Space Flight Center in Huntsville, Alabama, manages the Chandra program. The Smithsonian Astrophysical Observatory’s Chandra X-ray Center controls science operations from Cambridge, Massachusetts, and flight operations from Burlington, Massachusetts.\nTo learn more about Chandra, visit:\nhttps://science.nasa.gov/chandra\nRead more from NASA’s Chandra X-ray Observatory\nLearn more about the Chandra X-ray Observatory and its mission here:\nVisual Description\nThis release features a ten second silent video of Kepler’s expanding Supernova Remnant, located in our own galaxy, about 17,000 light-years from Earth. The video was created using X-ray data gathered in 2000, 2004, 2006, 2014, and 2025. Those distinct datasets were turned into highly-detailed visuals, creating a 25-year timelapse-style video of the growing remnant.\nKepler’s Supernova Remnant was once a white dwarf star that exploded when it exceeded its critical mass. Here, in X-ray light, the remnant resembles a cloudy neon blue ring with a diagonal cross line stretching from our upper right down to our lower left. The ring appears thinner and wispier at the bottom, with a band of white arching across the top.\nAs the video plays, cycling through the 5 datasets, the ring subtly, but clearly, expands, like a slowly inflating balloon. In the video, this sequence is replayed several times with dates included at our lower right, to give sighted learners time to absorb the visual information. Upon close inspection, researchers have determined that the bottom of the remnant is expanding fastest; about 13.8 million miles per hour, or 2% of the speed of light. The top of the ring appears to be expanding the slowest; about 4 million miles per hour, or 0.5% of the speed of light. The large difference in speed is because the gas that the remnant is plowing into towards the top of the image is denser than the gas towards the bottom.\nCollecting and interpreting this data over decades has provided information about the environment into which the white dwarf star exploded, and has helped scientists understand how remnants change with time."
}