{
  "doc_id": "https://www.nasa.gov/centers-and-facilities/johnson/diving-into-human-spaceflight-safety-with-nasa-johnsons-craig-shannon/",
  "source": "NASA",
  "url": "https://www.nasa.gov/centers-and-facilities/johnson/diving-into-human-spaceflight-safety-with-nasa-johnsons-craig-shannon/",
  "title": "Diving Into Human Spaceflight Safety with NASA Johnson’s Craig Shannon",
  "published_at": "Tue, 06 Jan 2026 09:39:00 +0000",
  "language": null,
  "section": null,
  "content_raw_text": "Growing up in Houston, Craig Shannon was always inspired by NASA and the spirit of exploration the agency represents. Yet it was a passion for scuba diving that unexpectedly led to his more than 23-year career at NASA’s Johnson Space Center.\nShannon became a certified diver and scuba instructor while earning his bachelor’s degree in communications from Stephen F. Austin State University. He happened to meet divers from NASA’s Neutral Buoyancy Laboratory (NBL) at a local environmental cleanup event during his senior year. “The encounter planted a seed,” he said.\nShannon was hired as an NBL diver shortly after graduation, launching what would become a 19-year career in dive operations. He progressed through a variety of roles – from utility diver, instructor, and training officer, to dive operations lead, training group lead, and ultimately, dive operations manager. “Each role deepened my understanding of operational excellence, safety, and leadership in high-performance environments,” he said. Shannon added that becoming the dive operations manager was one of the defining points of his career. “I had the privilege of leading an exceptional team and contributing directly to astronaut training and operational excellence.”\nSeeking new challenges and opportunities for professional growth, Shannon transitioned to a test safety officer position at Johnson for about four years, expanding his knowledge of technical risk management in different environments. He returned to the NBL in 2025, this time as a safety officer. In that role, Shannon works to protect employees’ well-being and the facility’s operational integrity. His responsibilities are a mix of proactive safety initiatives – such as facility inspections, safety training, and communication – and incident response, which involves investigating mishaps and close calls and developing corrective action plans to prevent recurrence. He also serves as an internal technical consultant, fielding safety-related questions from employees and visitors and providing guidance that complies with Occupational Safety and Health Administration and NASA safety standards.\n“I work across functions with operations, engineering, medical, and training teams to integrate safety into all daily processes and long-term planning,” he said. “It brings full circle my commitment to the safety and success of human spaceflight training.”\nShannon acknowledged that not having an engineering degree has made work more challenging at times, but it has not hindered his advancement. “I’ve earned key positions by committing myself to continuous learning, gaining in-depth knowledge of the technical areas I work in, and consistently demonstrating dedication to both my employers and my career,” he said. “My path has required hard work, adaptability, and a proactive approach to professional growth, which I view as strengths that have allowed me to contribute meaningfully in a highly technical setting.”\nShannon has also learned the importance of embracing change. “Change isn’t always easy, but it’s often where the most learning and development happen,” he said. “Whether it was stepping into leadership for the first time, shifting into a new field, or returning to a familiar place with a new purpose, each transition brought growth I never could have anticipated.” He added that patience, accountability, and empathy are important leadership qualities that help build stronger, more resilient teams.\nWhile Shannon takes pride in his work, he said his family is his greatest achievement. “I’m most proud of raising three amazing children with my wife, Kimberley. They have been my grounding force and greatest inspiration,” he said.\nHe is also the proud co-owner of a local scuba diving company, which allows him to combine his love for diving, travel, and community. “I’ve had the privilege of leading dive trips around the world with groups of amazing people—sharing unforgettable underwater experiences and fostering a strong, adventurous dive community,” he said. “It’s a way for me to stay connected to the roots of my diving career and continue exploring the world through the lens of curiosity and connection.”\nHe encourages the next generation to find something they are passionate about. “It’s important to be genuinely excited about what you do and to face the challenges ahead with determination and curiosity,” he said. “That energy, paired with a willingness to adapt and grow, has carried me through each phase of my career. Challenges will come, but how you meet them defines your path.”"
}