{
  "doc_id": "https://www.nasa.gov/missions/station/iss-research/space-station-research-informs-new-fda-approved-cancer-therapy/",
  "source": "NASA",
  "url": "https://www.nasa.gov/missions/station/iss-research/space-station-research-informs-new-fda-approved-cancer-therapy/",
  "title": "Space Station Research Informs New FDA-Approved Cancer Therapy",
  "published_at": "Tue, 06 Jan 2026 16:00:00 +0000",
  "language": null,
  "section": null,
  "content_raw_text": "NASA opens the International Space Station for scientists and researchers, inviting them to use the benefits of microgravity for commercial and public research, technology demonstrations, and more. Today, a portion of the crew’s time aboard station is devoted to private industry, including medical research that addresses complex health challenges on Earth and prepares astronauts for future deep space missions.\nIn collaboration with scientists at Merck, protein crystal growth research on the space station yielded early insights regarding the structure and size of particles best suited for the development of a new formulation of the company’s cancer medicine pembrolizumab for subcutaneous injection. This new route of delivery was approved by the U.S. Food and Drug Administration in September and offers a time-saving alternative to intravenous infusion for certain patients. These research efforts aboard the space station were supported by the ISS National Laboratory.\nOriginally, the treatment was delivered during an in-office visit via infusion therapy into the patient’s veins, a process that could take up to two hours. Initial delivery improvements reduced infusion times to less than 30 minutes every three weeks. The newly approved subcutaneous injectable form takes about one minute every three weeks, promising to improve quality of life for patients by reducing cost and significantly reducing treatment time for patients and healthcare providers.\nSince 2014, Merck has flown crystal growth experiments to the space station to better understand how crystals form, including the monoclonal antibody used in this cancer treatment. Monoclonal antibodies are lab-made proteins that help the body fight diseases. This research focused on producing crystalline suspensions that dissolve easily in liquid, making it possible to deliver the medication by injection. In microgravity, the absence of gravity’s physical forces allows scientists to grow larger, more uniform, and higher-quality crystals than those grown in ground-based labs, advancing medication development and structural modeling.\nResearch aboard the space station has provided valuable insights into how gravity influences crystallization, helping to improve drug formulations. The work of NASA and its partners aboard the space station improves lives on Earth, grows a commercial economy in low Earth orbit, and prepares for human exploration of the Moon and Mars."
}