{
  "doc_id": "https://science.nasa.gov/missions/webb/scientists-identify-astronomys-platypus-with-nasas-webb-telescope/",
  "source": "NASA",
  "url": "https://science.nasa.gov/missions/webb/scientists-identify-astronomys-platypus-with-nasas-webb-telescope/",
  "title": "Scientists Identify ‘Astronomy’s Platypus’ with NASA’s Webb Telescope",
  "published_at": "Tue, 06 Jan 2026 17:16:00 +0000",
  "language": null,
  "section": null,
  "content_raw_text": "After combing through NASA’s James Webb Space Telescope’s archive of sweeping extragalactic cosmic fields, a small team of astronomers at the University of Missouri says they have identified a sample of galaxies that have a previously unseen combination of features. Principal investigator Haojing Yan compares the discovery to an infamous oddball in another branch of science: biology’s taxonomy-defying platypus.\n“It seems that we’ve identified a population of galaxies that we can’t categorize, they are so odd. On the one hand they are extremely tiny and compact, like a point source, yet we do not see the characteristics of a quasar, an active supermassive black hole, which is what most distant point sources are,” said Yan.\nThe research was presented in a press conference at the 247th meeting of the American Astronomical Society in Phoenix.\nImage A: Galaxies in CEERS Field (NIRCam image)\n“I looked at these characteristics and thought, this is like looking at a platypus. You think that these things should not exist together, but there it is right in front of you, and it’s undeniable,” Yan said.\nThe team whittled down a sample of 2,000 sources across several Webb surveys to identify nine point-like sources that existed 12 to 12.6 billion years ago (compared to the universe’s age of 13.8 billion years). Spectral data gives astronomers more information than they can get from an image alone, and for these nine sources it doesn’t fit existing definitions. They are too far away to be stars in our own galaxy, and too faint to be quasars, which are so brilliant that they outshine their host galaxies. Though the spectra resemble the less distant “green pea” galaxies discovered in 2009, the galaxies in this sample are much more compact.\n“Like spectra, the detailed genetic code of a platypus provides additional information that shows just how unusual the animal is, sharing genetic features with birds, reptiles, and mammals,” said Yan. “Together, Webb’s imaging and spectra are telling us that these galaxies have an unexpected combination of features.”\nYan explained that for typical quasars, the peaks in their characteristic spectral emission lines look like hills, with a broad base, indicating the high velocity of gas swirling around their supermassive black hole. Instead, the peaks for the “platypus population” are narrow and sharp, indicating slower gas movement.\nWhile there are narrow-line galaxies that host active supermassive black holes, they do not have the point-like feature of the sample Yan’s team has identified.\nImage B: Galaxy CEERS 4233-42232: Comparison With Quasar Spectrum\nHas Yan’s team discovered a missing link in the cosmos? Once the team determined that the objects didn’t fit the definition of a quasar, graduate student researcher Bangzheng Sun analyzed the data to see if there were signatures of star-forming galaxies.\n“From the low-resolution spectra we have, we can’t rule out the possibility that these nine objects are star-forming galaxies. That data fits,” said Sun. “The strange thing in that case is that the galaxies are so tiny and compact, even though Webb has the resolving power to show us a lot of detail at this distance.”\nOne proposal the team suggests is that Webb, as promised, is revealing earlier stages of galaxy formation and evolution than we have ever been able to see before. It is generally accepted across the astronomy community that large, massive galaxies like our own Milky Way grew by many smaller galaxies merging together. But, Yan asks, what comes before small galaxies?\n“I think this new research is presenting us with the question, how does the process of galaxy formation first begin? Can such small, building-block galaxies be formed in a quiet way, before chaotic mergers begin, as their point-like appearance suggests?” Yan said.\nTo begin answering that question, as well as to determine more about the nature of their odd platypuses, the team says they need a much larger sample than nine to analyze, and with higher-resolution spectra.\n“We cast a wide net, and we found a few examples of something incredible. These nine objects weren’t the focus; they were just in the background of broad Webb surveys,” said Yan. “Now it’s time to think about the implications of that, and how we can use Webb’s capabilities to learn more.”\nThe James Webb Space Telescope is the world’s premier space science observatory. Webb is solving mysteries in our solar system, looking beyond to distant worlds around other stars, and probing the mysterious structures and origins of our universe and our place in it. Webb is an international program led by NASA with its partners, ESA (European Space Agency) and CSA (Canadian Space Agency).\nTo learn more about Webb, visit:\nDownloads & Related Information\nThe following sections contain links to download this article's images and videos in all available resolutions followed by related information links, media contacts, and if available, research paper and spanish translation links."
}