{
  "doc_id": "https://science.nasa.gov/missions/webb/nasa-webb-finds-early-universe-analogs-unexpected-talent-for-making-dust/",
  "source": "NASA",
  "url": "https://science.nasa.gov/missions/webb/nasa-webb-finds-early-universe-analogs-unexpected-talent-for-making-dust/",
  "title": "NASA Webb Finds Early-Universe Analog’s Unexpected Talent for Making Dust",
  "published_at": "Tue, 06 Jan 2026 17:14:00 +0000",
  "language": null,
  "section": null,
  "content_raw_text": "Using NASA’s James Webb Space Telescope, astronomers have spotted two rare kinds of dust in the dwarf galaxy Sextans A, one of the most chemically primitive galaxies near the Milky Way. The finding of metallic iron dust and silicon carbide (SiC) produced by aging stars, along with tiny clumps of carbon-based molecules, shows that even when the universe had only a fraction of today’s heavy elements, stars and the interstellar medium could still forge solid dust grains. This research with Webb is reshaping ideas about how early galaxies evolved and developed the building blocks for planets, as NASA explores the secrets of the universe and our place in it.\nSextans A lies about 4 million light-years away and contains only 3 to 7 percent of the Sun’s metal content, or metallicity, the astrophysical term for elements heavier than hydrogen and helium. Because the galaxy is so small, unlike other nearby galaxies, its gravitational pull is too weak to retain the heavy elements like iron and oxygen created by supernovae and aging stars.\nGalaxies like it resemble those that filled the early universe just after the big bang, when the universe was made of mostly hydrogen and helium, before stars had time to enrich space with ‘metals.’ Because it is relatively close, Sextans A gives astronomers a rare chance to study individual stars and interstellar clouds under conditions similar to those shortly after the big bang.\n“Sextans A is giving us a blueprint for the first dusty galaxies,” said Elizabeth Tarantino, postdoctoral researcher at the Space Telescope Science Institute and lead author of the results in one of the two studies presented at a press conference at the 247th meeting of the American Astronomical Society in Phoenix. “These results help us interpret the most distant galaxies imaged by Webb and understand what the universe was building with its earliest ingredients.”\nImage A: Sextans A PAHs Pull-out (NIRCam and MIRI Image)\nForging dust without usual ingredients\nOne of those studies, published in the Astrophysical Journal, honed in on a half a dozen stars with the low-resolution spectrometer aboard Webb’s MIRI (Mid-Infrared Instrument). The data collected shows the chemical fingerprints of the bloated stars very late in their evolution, called asymptotic giant branch (AGB) stars. Stars with masses between one and eight times that of the Sun pass through this phase.\n“One of these stars is on the high-mass end of the AGB range, and stars like this usually produce silicate dust. However, at such low metallicity, we expect these stars to be nearly dust-free,” said Martha Boyer, associate astronomer at the Space Telescope Science Institute and lead author in that second companion study. “Instead, Webb revealed a star forging dust grains made almost entirely of iron. This is something we’ve never seen in stars that are analogs of stars in the early universe.”\nSilicates, the usual dust formed by oxygen-rich stars, require elements like silicon and magnesium that are almost nonexistent in Sextans A. It would be like trying to bake cookies in a kitchen without flour, sugar, and butter.\nA normal cosmic kitchen, like the Milky Way, has those crucial ingredients in the form of silicon, carbon, and iron. In a primitive kitchen, like Sextans A, where almost all of those ingredients are missing, you barely have any proverbial flour or sugar. Therefore, astronomers expected that without those key ingredients, stars in Sextans A couldn’t “bake” much dust at all.\nHowever, not only did they find dust, but Webb showed that one of these stars used an entirely different recipe than usual to make that dust.\nThe iron-only dust, as well as silicon carbide produced by the less massive AGB stars despite the galaxy’s low silicon abundance, proves that evolved stars can still build solid material even when the typical ingredients are missing.\n“Dust in the early universe may have looked very different from the silicate grains we see today,” Boyer said. “These iron grains absorb light efficiently but leave no sharp spectral fingerprints and can contribute to the large dust reservoirs seen in far-away galaxies detected by Webb.”\nImage B: Sextans A Context Image (Webb and KPNO)\nTiny clumps of organic molecules\nIn the companion study, currently under peer review, Webb imaged Sextans A’s interstellar medium and discovered polycyclic aromatic hydrocarbons (PAHs), which are complex, carbon-based molecules and the smallest dust grains that glow in infrared light. The discovery means Sextans A is now the lowest-metallicity galaxy ever found to contain PAHs.\nBut, unlike the broad, sweeping PAH emission seen in metal-rich galaxies, Webb revealed PAHs in tiny, dense pockets only a few light-years across.\n“Webb shows that PAHs can form and survive even in the most metal-starved galaxies, but only in small, protected islands of dense gas,” said Tarantino.\nThe clumps likely represent regions where dust shielding and gas density reach just high enough to allow PAHs to form and grow, solving a decades-long mystery about why PAHs seem to vanish in metal-poor galaxies.\nThe team has an approved Webb Cycle 4 program to use high-resolution spectroscopy to study the detailed chemistry of Sextans A’s PAH clumps further.\nImage C: Giant Star in Dwarf Galaxy Sextans A (Spectrum)\nConnecting two discoveries\nTogether, the results show that the early universe had more diverse dust production pathways than the more established and proven methods, like supernova explosions. Additionally, researchers now know there’s more dust than predicted at extremely low metallicities.\n“Every discovery in Sextans A reminds us that the early universe was more inventive than we imagined,” said Boyer. “Clearly stars found a way to make the building blocks of planets long before galaxies like our own existed.”\nThe James Webb Space Telescope is the world’s premier space science observatory. Webb is solving mysteries in our solar system, looking beyond to distant worlds around other stars, and probing the mysterious structures and origins of our universe and our place in it. Webb is an international program led by NASA with its partners, ESA (European Space Agency) and CSA (Canadian Space Agency).\nTo learn more about Webb, visit:\nDownloads & Related Information\nThe following sections contain links to download this article's images and videos in all available resolutions followed by related information links, media contacts, and if available, research paper and spanish translation links."
}