{
  "doc_id": "https://www.nasa.gov/centers-and-facilities/marshall/nasa-marshall-prepares-for-demolition-of-historic-test-simulation-facilities/",
  "source": "NASA",
  "url": "https://www.nasa.gov/centers-and-facilities/marshall/nasa-marshall-prepares-for-demolition-of-historic-test-simulation-facilities/",
  "title": "NASA Marshall Prepares for Demolition of Historic Test, Simulation Facilities",
  "published_at": "Tue, 06 Jan 2026 18:44:30 +0000",
  "language": null,
  "section": null,
  "content_raw_text": "NASA is preparing for the demolition of three iconic structures at the agency’s Marshall Space Flight Center in Huntsville, Alabama.\nCrews began demolition in mid-December at the Neutral Buoyancy Simulator, a facility built in the late 1960s that once enabled NASA astronauts and researchers to experience near-weightlessness. The facility was also used to conduct underwater testing of space hardware and practice runs for servicing the Hubble Space Telescope. The simulator was closed in 1997.\nTwo test stands – the Propulsion and Structural Test Facility and Dynamic Test Facility – are also slated for demolition, one after the other, by carefully coordinated implosion no earlier than sunrise on Jan. 10, 2026.\nThe demolition of these historic structures is part of a larger project that began in spring 2022, targeting several inactive structures no longer needed for the agency’s missions. All three towering fixtures played crucial roles in getting humans to the Moon, into low-Earth orbit, and beyond.\nThese structures have reached the end of their safe, operational life, and their removal has been long-planned as part of a broader effort to modernize Marshall’s footprint. This demolition is the first phase of an initiative that will ultimately remove 25 outdated structures, reduce maintenance burdens, and position Marshall to take full advantage of a guaranteed NASA center infrastructure investment authorized under the Working Families Tax Credit Act.\nThis work reflects smart stewardship of taxpayer resources.\njared isaacman\nNASA Administrator\n“This work reflects smart stewardship of taxpayer resources,” said NASA Administrator Jared Isaacman. “Clearing outdated infrastructure allows NASA to safely modernize, streamline operations, and fully leverage the infrastructure investments signed into law by President Trump to keep Marshall positioned at the forefront of aerospace innovation.”\nBuilt in 1964, the Dynamic Test Stand initially was used to test fully assembled Saturn V rockets. In 1978, engineers integrated all space shuttle elements for the first time, including the orbiter, external fuel tank, and solid rocket boosters. It was last used in the early 2000s for microgravity testing.\nThe Propulsion and Structural Test Facility – better known at Marshall as the “T-tower” due to its unique shape – was built in 1957 by the U.S. Army Ballistic Missile Agency and transferred to NASA when Marshall was founded in 1960. There, engineers tested components of the Saturn launch vehicles, the Army’s Redstone Rocket, and shuttle solid rocket boosters. It was last used for space shuttle solid rocket motor tests in the 1990s.\n“Each one of these structures helped NASA make history,” said Rae Ann Meyer, acting center director at Marshall. “While it is hard to let them go, they’ve earned their retirement. The people who built and managed these facilities and empowered our mission of space exploration are the most important part of their legacy.”\n“These structures are not safe,” continued Meyer. “Strategic demolition is a necessary step in shaping the future of NASA’s mission to explore, innovate, and inspire. By removing these structures that we have not used in decades, we are saving money on upkeep of facilities we can’t use. We also are making these areas safe to use for future NASA exploration endeavors and investments.”\nA legacy worth remembering\nWhen NASA opened the Neutral Buoyancy Simulator in 1968, it was one of few places on Earth that could recreate the weightlessness of microgravity. The facility provided a simulated zero-gravity environment in which engineers and astronauts could find out how their designs might handle in orbit. The tank has been central to planning and problem-solving for Skylab missions, repairs to NASA’s Hubble Space Telescope, and more. The tank is 75 feet in diameter, 40 feet deep, and designed to hold up to nearly 1.5 million gallons of water. It was replaced in 1997 by a new, larger facility at NASA’s Johnson Space Center in Houston.\nThe Propulsion and Structural Test Facility is one of the oldest test stands at Marshall. The dual-position test stand, sometimes called the T-tower, was built for static testing large rockets and launch systems – like launching a rocket while keeping it restrained and wired to instruments that collect data. The tests and data played a role in the development of the Saturn family of rockets, including the F-1 engine and S-IC.\nThe Dynamic Test Stand, a 360-foot tower topped by a 64-foot derrick, was once the tallest human-made structure in North Alabama. Engineers there conducted full-scale tests of Saturn V rockets – the same powerful vehicles that carried Apollo astronauts to the Moon. Later, the stand served as the first location where all space shuttle elements were integrated.\nPreserving history for future generations\nThe irreplaceable historical value of these landmarks has prompted NASA to undertake extensive efforts to preserve their stories for future generations. The three facilities were made national landmarks in 1985 for their part in human spaceflight. In keeping with Section 106 of the National Historic Preservation Act, master planners and engineers at Marshall completed a rigorous consultation and mitigation process for each landmark, working closely with Alabama’s State Historic Preservation Office to preserve their history for future generations.\nDetailed architectural documentation, written histories, and large-format photographs are permanently archived in the Library of Congress’ Historic American Engineering Record collection, making this history accessible to researchers and the public for generations.\nAdditionally, NASA has partnered with Auburn University to create high-resolution digital models of each facility. The project used technologies like LiDAR and 360-photography of the structures in detail before demolition. Their goal is to preserve not just the appearance, but the sense of scale and engineering achievement they represent. The models are still in work, but they’ll eventually be publicly available.\nSelect artifacts from the facilities have also been identified and transferred to the U.S. Space & Rocket Center through NASA’s Artifact Program, ensuring tangible pieces of this history remain available for educational purposes.\nHonoring the past, building the future\nFor the employees, retirees, and community members who remember these facilities over the decades, their removal marks the end of an era. But their contributions live on in every NASA mission, from the International Space Station to the upcoming Artemis II lunar missions and more.\n“NASA’s vision of space exploration remains vibrant, and as we look to an exciting future, we honor the past, especially the dedication of the men and women who built these structures and tested hardware that has launched into space, made unprecedented scientific discoveries, and inspired generations of Americans to reach for the stars,” said Meyer.\nThe demolitions represent more than removing obsolete infrastructure. They’re part of NASA’s commitment to building a dynamic, interconnected campus ready for the next era of space exploration while honoring the bold spirit that has always driven the agency forward.\nVirtual tours and preserved documentation will be made available on Marshall’s digital channels. Marshall will also share video of the test stand demolitions after the event.\nFor communities near Redstone Arsenal, there could be a loud noise associated with the demolition on the morning of Jan. 10."
}